In [1]:
import pandas as pd
import random

In [2]:
df = pd.DataFrame({"values": [random.randint(11, 15) for i in range(9)] + [400]})
df

   values
0      15
1      12
2      11
3      12
4      13
5      15
6      14
7      14
8      12
9     400

In [6]:
q1 = df['values'].quantile(0.25)
q3 = df["values"].quantile(0.75)
iqr = q3 - q1

In [7]:
lb, ub = q1 - 1.5 * iqr, q3 + 1.5 * iqr
outliars = df[(df['values'] < lb) | (df['values'] > ub)]
outliars

   values
9     400

In [24]:
ser = pd.Series([43,43,43, 65, 23, 54, 13,23, 54,])

In [25]:
ser.rank(method = "average")

0    5.0
1    5.0
2    5.0
3    9.0
4    2.5
5    7.5
6    1.0
7    2.5
8    7.5
dtype: float64

In [26]:
ser.rank(method = 'min')

0    4.0
1    4.0
2    4.0
3    9.0
4    2.0
5    7.0
6    1.0
7    2.0
8    7.0
dtype: float64

In [27]:
ser.rank(method = 'max')

0    6.0
1    6.0
2    6.0
3    9.0
4    3.0
5    8.0
6    1.0
7    3.0
8    8.0
dtype: float64

In [28]:
ser.rank(method = 'first')

0    4.0
1    5.0
2    6.0
3    9.0
4    2.0
5    7.0
6    1.0
7    3.0
8    8.0
dtype: float64

In [29]:
ser.rank(method = 'dense')

0    3.0
1    3.0
2    3.0
3    5.0
4    2.0
5    4.0
6    1.0
7    2.0
8    4.0
dtype: float64

# Data selection

In [32]:
name = ['name' + str(i) for i in range(1, 6)]
age = [random.randint(19, 23) for i in range(5)]
city = ['city' + str(i) for i in range(1, 6)]
score=  [random.randint(40, 50) for i in range(1, 6)]
df = pd.DataFrame(data = {
    'name' : name,
    'age' : age,
    'city' : city,
    'score' : score
})

df

    name  age   city  score
0  name1   21  city1     42
1  name2   21  city2     49
2  name3   19  city3     48
3  name4   23  city4     44
4  name5   20  city5     44

In [33]:
df['name']

0    name1
1    name2
2    name3
3    name4
4    name5
Name: name, dtype: object

In [35]:
df[['name', 'score']]

    name  score
0  name1     42
1  name2     49
2  name3     48
3  name4     44
4  name5     44

In [36]:
df.iloc[0]

name     name1
age         21
city     city1
score       42
Name: 0, dtype: object

In [37]:
df.iloc[:3]

    name  age   city  score
0  name1   21  city1     42
1  name2   21  city2     49
2  name3   19  city3     48

In [38]:
df.iloc[1:4, [0, 2]]

    name   city
1  name2  city2
2  name3  city3
3  name4  city4

In [43]:
df.loc[1:3, ['name', 'score']]

    name  score
1  name2     49
2  name3     48
3  name4     44

In [39]:
df.loc[2]

name     name3
age         19
city     city3
score       48
Name: 2, dtype: object

In [41]:
df[(df['age'] > 20)  & (df['age'] <= 23 )]

    name  age   city  score
0  name1   21  city1     42
1  name2   21  city2     49
3  name4   23  city4     44

In [44]:
df[df['city'].isin(['city1', 'city4'])]

    name  age   city  score
0  name1   21  city1     42
3  name4   23  city4     44

In [45]:
df[df.at(0,'score')

SyntaxError: incomplete input (2555340162.py, line 1)